; domain
(define (domain serveBreakfast)
  (:requirements :strips :conditional-effects  :equality)

  ;; ───── Constants ────
  ;; Fixed objects in the scene
  (:constants bread egg fridge knife plate pan mug toaster stoveburner coffeemachine dining_table counter_1 counter_2 counter_1_l counter_2_l dining_table_l fridge_l default_l)

    ;; ───── Predicate Definitions ─────
    (:predicates
      (robotat ?l)
      (holding ?o)
      (open ?d)
      (switchedon ?d)
      (on ?d ?c)
      (in ?o ?c)
      (at ?o ?l)
      (handempty)
      (sliced ?o)
      (cooked ?o)
      (toasted ?o)
      (coffee_in ?m)
    )

    ;; ───── Action Definitions ─────
    ; #TODO
    (:action open
      :parameters (?d ?l)
      :precondition (and (robotat ?l) (not (open ?d)) (at ?d ?l))
      :effect (open ?d)
    )

    (:action move
      :parameters (?from ?to)
      :precondition (robotat ?from)
      :effect (and
        (not (robotat ?from))
        (robotat ?to)
      )
    )

    (:action turn_off
      :parameters (?d ?l)
      :precondition (and 
        (robotat ?l) 
        (at ?d ?l)
        (switchedon ?d)
      )
      :effect (not (switchedon ?d))
    )

    (:action turn_on
      :parameters (?d ?l)
      :precondition (and 
        (robotat ?l) 
        (at ?d ?l)
        (not (switchedon ?d))
      )
      :effect (and 
        (switchedon ?d)

        ;; this is when device=toaster, bread in toaster, bread=sliced then toast the bread
        (when (and (= ?d toaster) (in bread toaster) (sliced bread))
          (toasted bread)
        )

        ;; this is when device=coffeemachine, mug in coffeemachine then put coffee in mug
        (when (and (= ?d coffeemachine) (in mug coffeemachine))
          (coffee_in mug)
        )

        ;; this is when device=toaster, egg in pan, pan on stoveburner then cook the egg
        (when (and (= ?d stoveburner) (in egg pan) (on pan stoveburner))
          (cooked egg)
        )
      )
    )

    (:action slice
      :parameters (?o ?l)
      :precondition (and 
        (robotat ?l) 
        (holding knife)
        (not (handempty))
        (not (sliced ?o))
        (or 
          (and 
            (= ?o bread)
            (not (toasted ?o))
            (on ?o counter_1)
            (= ?l counter_1_l)
          )
          (and
            (= ?o egg)
            (not (cooked ?o))
            (on ?o counter_2)
            (= ?l counter_2_l)
          )
        )
      )
      :effect (sliced ?o)
    )

    (:action pick
      :parameters (?o ?c ?l)
      :precondition (and 
        (robotat ?l) 
        (not (holding ?o))
        (handempty)
        (or (on ?o ?c) (in ?o ?c))
        (at ?o ?l)
        (at ?c ?l)
        (or (not (= ?c fridge)) (open ?c))

      )
      :effect (and
        (holding ?o)
        (not (handempty))
        (not (on ?o ?c))
        (not (in ?o ?c))
        (not (at ?o ?l))
      )
    )

    (:action put
      :parameters (?o ?c ?l)
      :precondition (and 
        (robotat ?l) 
        (holding ?o)
        (not (handempty))
        (not (on ?o ?c))
        (not (in ?o ?c))
        (at ?c ?l)
        (not (or (= ?c bread) (= ?c egg) (= ?c knife)))
      )
      :effect (and
        (not (holding ?o))
        (handempty)
        (at ?o ?l)
        (when (or 
          (= ?c toaster) 
          (= ?c coffeemachine) 
          (= ?c mug) 
          (= ?c fridge)
          (= ?c pan)
        )
          (in ?o ?c)
        )
        (when (or 
          (= ?c plate) 
          (= ?c counter_1) 
          (= ?c counter_2) 
          (= ?c dining_table)
          (= ?c stoveburner)
        )
          (on ?o ?c)
        )
      )
    )
  )

; problem
(define (problem serveBreakfast-totable)
  (:domain servebreakfast)

  (:init
    ;; #TODO  

    ; Configurations
    (handempty)

    ; Objects location
    (robotat default_l)

    (in bread fridge)
    (in egg fridge)
    (on knife counter_1)
    (on toaster counter_1)
    (on mug counter_2)
    (on pan counter_2)
    (on plate dining_table)
    (on stoveburner counter_2)
    (on coffeemachine counter_1)
    
    (at fridge fridge_l)
    (at counter_1 counter_1_l)
    (at dining_table dining_table_l)
    (at counter_2 counter_2_l)

    (at bread fridge_l)
    (at egg fridge_l)
    (at knife counter_1_l)
    (at mug counter_2_l)
    (at pan counter_2_l)
    (at toaster counter_1_l)
    (at plate dining_table_l)
    (at stoveburner counter_2_l)
    (at coffeemachine counter_1_l)
  )

  (:goal 
    ;; #TODO
    (and
      ;; toast
      (sliced bread)
      (toasted bread)
      (on bread plate)
      (on plate dining_table)

      ;; egg
      (cooked egg)
      (in egg pan)
      (on pan dining_table)

      ;; coffee
      (coffee_in mug)
      (on mug dining_table)
    )
  )
)

; plan
1. (move default_l fridge_l)
   deleted: (robotat default_l)
   added: (robotat fridge_l)
   goals met: 1 of 9
2. (open fridge fridge_l)
   added: (open fridge)
   goals met: 1 of 9
3. (pick bread fridge fridge_l)
   deleted: (handempty) (in bread fridge) (at bread fridge_l)
   added: (holding bread)
   goals met: 1 of 9
4. (move fridge_l counter_1_l)
   deleted: (robotat fridge_l)
   added: (robotat counter_1_l)
   goals met: 1 of 9
5. (put bread counter_1 counter_1_l)
   deleted: (holding bread)
   added: (handempty) (at bread counter_1_l) (on bread counter_1)
   goals met: 1 of 9
6. (pick knife counter_1 counter_1_l)
   deleted: (handempty) (on knife counter_1) (at knife counter_1_l)
   added: (holding knife)
   goals met: 1 of 9
7. (slice bread counter_1_l)
   added: (sliced bread)
   goals met: 2 of 9
8. (put knife counter_1 counter_1_l)
   deleted: (holding knife)
   added: (handempty) (at knife counter_1_l) (on knife counter_1)
   goals met: 2 of 9
9. (pick bread counter_1 counter_1_l)
   deleted: (handempty) (on bread counter_1) (at bread counter_1_l)
   added: (holding bread)
   goals met: 2 of 9
10. (put bread toaster counter_1_l)
   deleted: (holding bread)
   added: (handempty) (at bread counter_1_l) (in bread toaster)
   goals met: 2 of 9
11. (turn_on toaster counter_1_l)
   added: (switchedon toaster) (toasted bread)
   goals met: 3 of 9
12. (pick bread toaster counter_1_l)
   deleted: (handempty) (in bread toaster) (at bread counter_1_l)
   added: (holding bread)
   goals met: 3 of 9
13. (move counter_1_l dining_table_l)
   deleted: (robotat counter_1_l)
   added: (robotat dining_table_l)
   goals met: 3 of 9
14. (put bread plate dining_table_l)
   deleted: (holding bread)
   added: (handempty) (at bread dining_table_l) (on bread plate)
   goals met: 4 of 9
15. (move dining_table_l counter_2_l)
   deleted: (robotat dining_table_l)
   added: (robotat counter_2_l)
   goals met: 4 of 9
16. (pick mug counter_2 counter_2_l)
   deleted: (handempty) (on mug counter_2) (at mug counter_2_l)
   added: (holding mug)
   goals met: 4 of 9
17. (move counter_2_l counter_1_l)
   deleted: (robotat counter_2_l)
   added: (robotat counter_1_l)
   goals met: 4 of 9
18. (put mug coffeemachine counter_1_l)
   deleted: (holding mug)
   added: (handempty) (at mug counter_1_l) (in mug coffeemachine)
   goals met: 4 of 9
19. (turn_on coffeemachine counter_1_l)
   added: (switchedon coffeemachine) (coffee_in mug)
   goals met: 5 of 9
20. (pick mug coffeemachine counter_1_l)
   deleted: (handempty) (in mug coffeemachine) (at mug counter_1_l)
   added: (holding mug)
   goals met: 5 of 9
21. (move counter_1_l dining_table_l)
   deleted: (robotat counter_1_l)
   added: (robotat dining_table_l)
   goals met: 5 of 9
22. (put mug dining_table dining_table_l)
   deleted: (holding mug)
   added: (handempty) (at mug dining_table_l) (on mug dining_table)
   goals met: 6 of 9
23. (move dining_table_l fridge_l)
   deleted: (robotat dining_table_l)
   added: (robotat fridge_l)
   goals met: 6 of 9
24. (pick egg fridge fridge_l)
   deleted: (handempty) (in egg fridge) (at egg fridge_l)
   added: (holding egg)
   goals met: 6 of 9
25. (move fridge_l counter_2_l)
   deleted: (robotat fridge_l)
   added: (robotat counter_2_l)
   goals met: 6 of 9
26. (put egg pan counter_2_l)
   deleted: (holding egg)
   added: (handempty) (at egg counter_2_l) (in egg pan)
   goals met: 7 of 9
27. (pick pan counter_2 counter_2_l)
   deleted: (handempty) (on pan counter_2) (at pan counter_2_l)
   added: (holding pan)
   goals met: 7 of 9
28. (put pan stoveburner counter_2_l)
   deleted: (holding pan)
   added: (handempty) (at pan counter_2_l) (on pan stoveburner)
   goals met: 7 of 9
29. (turn_on stoveburner counter_2_l)
   added: (switchedon stoveburner) (cooked egg)
   goals met: 8 of 9
30. (pick pan stoveburner counter_2_l)
   deleted: (handempty) (on pan stoveburner) (at pan counter_2_l)
   added: (holding pan)
   goals met: 8 of 9
31. (move counter_2_l dining_table_l)
   deleted: (robotat counter_2_l)
   added: (robotat dining_table_l)
   goals met: 8 of 9
32. (put pan dining_table dining_table_l)
   deleted: (holding pan)
   added: (handempty) (at pan dining_table_l) (on pan dining_table)
   goals met: 9 of 9
